leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 4*/
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 8*/
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_8 {516, 6}
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_8 {524, 6}

/* Pad: 9*/
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_9 {517, 5}
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_9 {525, 5}

/* Pad: 10*/
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER1 PORT_FUNC3
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER2 PORT_FUNC6
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER3 PORT_FUNC9
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER4 PORT_FUNC10
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER5 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_10 {515, 7}
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_10 {523, 7}

/* Pad: 11*/
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_11 {516, 7}
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_11 {524, 7}
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_11 {758, 2}
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_11 {759, 2}
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_11 {772, 2}
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_11 {773, 2}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_11 {848, 2}

/* Pad: 12*/
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER1 PORT_FUNC3
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_12 {533, 4}
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_12 {541, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_12 {888, 1}
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_12 {894, 2}

/* Pad: 13*/
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_13 {534, 4}
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_13 {542, 4}
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_13 {758, 1}
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_13 {759, 1}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_13 {848, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_13 {887, 1}

/* Pad: 14*/
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_14 {515, 6}
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_14 {523, 6}

/* Pad: 15*/
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER5 PORT_FUNC1
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_15 {517, 3}
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_15 {525, 3}
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_15 {849, 7}
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_15 {863, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_15 {897, 4}

