leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 16*/
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 17*/
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 18*/
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 19*/
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 20*/
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 21*/
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 22*/
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 23*/
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 24*/
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_24 {514, 4}
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_24 {522, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_24 {896, 1}

/* Pad: 25*/
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_25 {512, 4}
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_25 {520, 4}
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_25 {758, 5}
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_25 {848, 11}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_25 {897, 1}

/* Pad: 26*/
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_26 {513, 4}
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_26 {521, 4}

/* Pad: 27*/
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_27 {516, 3}
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_27 {524, 3}
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_27 {850, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_27 {916, 7}

/* Pad: 28*/
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 29*/
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 30*/
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 31*/
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 32*/
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_32 {529, 2}
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_32 {537, 2}
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_32 {586, 2}

/* Pad: 33*/
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_33 {529, 1}
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_33 {537, 1}
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_33 {587, 2}
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_33 {863, 24}

/* Pad: 34*/
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER_A PORT_FUNC3
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_LIN PORT_FUNC6
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_34 {528, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_34 {536, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_34 {656, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_34 {657, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_34 {658, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_34 {659, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_34 {660, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_34 {661, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_34 {662, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_34 {663, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_34 {664, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_34 {665, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_34 {666, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_34 {667, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_34 {668, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_34 {669, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_34 {670, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_34 {671, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_34 {672, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_34 {673, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_34 {674, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_34 {675, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_34 {676, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_34 {677, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_34 {678, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_34 {679, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_34 {680, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_34 {681, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_34 {682, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER30 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER30_PAD_34 {683, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER31 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER31_PAD_34 {684, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER32 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER32_PAD_34 {685, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER33 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER33_PAD_34 {686, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER34 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER34_PAD_34 {687, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER35 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER35_PAD_34 {688, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER36 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER36_PAD_34 {689, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER37 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER37_PAD_34 {690, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER38 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER38_PAD_34 {691, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER39 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER39_PAD_34 {692, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER40 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER40_PAD_34 {693, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER41 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER41_PAD_34 {694, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER42 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER42_PAD_34 {695, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER43 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER43_PAD_34 {696, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER44 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER44_PAD_34 {697, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER45 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER45_PAD_34 {698, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER46 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER46_PAD_34 {699, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER47 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER47_PAD_34 {700, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER48 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER48_PAD_34 {701, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER49 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER49_PAD_34 {702, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER50 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER50_PAD_34 {703, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER51 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER51_PAD_34 {704, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER52 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER52_PAD_34 {705, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER53 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER53_PAD_34 {706, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER54 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER54_PAD_34 {707, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER55 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER55_PAD_34 {708, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER56 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER56_PAD_34 {709, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER57 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER57_PAD_34 {710, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER58 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER58_PAD_34 {711, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER59 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER59_PAD_34 {712, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER60 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER60_PAD_34 {713, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER61 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER61_PAD_34 {714, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER62 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER62_PAD_34 {715, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER63 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER63_PAD_34 {716, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER64 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER64_PAD_34 {717, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER65 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER65_PAD_34 {718, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER66 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER66_PAD_34 {719, 2}
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER67 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER67_PAD_34 {924, 1}

/* Pad: 35*/
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER_B PORT_FUNC4
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_35 {528, 1}
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_35 {536, 1}
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_35 {582, 1}

/* Pad: 36*/
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER_B PORT_FUNC4
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_36 {519, 1}
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_36 {527, 1}
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_36 {583, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_36 {890, 1}

