leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 37*/
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER_B PORT_FUNC4
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_37 {518, 1}
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_37 {526, 1}
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_37 {584, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_37 {889, 2}

/* Pad: 38*/
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_38 {517, 1}
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_38 {525, 1}
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_38 {585, 1}
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_38 {753, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_38 {889, 1}

/* Pad: 39*/
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_39 {516, 1}
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_39 {524, 1}
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_39 {586, 1}
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_39 {752, 4}
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_39 {753, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_39 {891, 1}
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_39 {917, 1}

/* Pad: 40*/
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_40 {515, 1}
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_40 {523, 1}
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_40 {587, 1}
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_40 {759, 3}
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_40 {773, 1}
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_40 {849, 6}
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_40 {863, 1}

/* Pad: 41*/
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_41 {514, 1}
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_41 {522, 1}

/* Pad: 42*/
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_42 {535, 6}
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_42 {543, 6}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_42 {923, 1}

/* Pad: 43*/
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_43 {534, 6}
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_43 {542, 6}
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_43 {848, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_43 {882, 5}
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_43 {894, 6}
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_43 {925, 1}
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_43 {926, 1}
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_43 {924, 4}

