leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 44*/
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_44 {533, 6}
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_44 {541, 6}
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_44 {773, 4}
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_44 {848, 3}
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_44 {849, 10}
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_44 {862, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_44 {885, 1}
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_44 {927, 1}

/* Pad: 45*/
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_45 {532, 6}
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_45 {540, 6}
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_45 {772, 4}
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_45 {849, 8}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_45 {883, 2}
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_45 {928, 1}

/* Pad: 46*/
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER1 PORT_FUNC6
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_46 {531, 6}
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_46 {539, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_46 {884, 1}
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_46 {893, 3}
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_46 {894, 4}

/* Pad: 47*/
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_47 {530, 5}
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_47 {538, 5}
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_47 {862, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_47 {883, 1}

/* Pad: 48*/
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_48 {528, 6}
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_48 {536, 6}

/* Pad: 49*/
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_49 {535, 5}
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_49 {543, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_49 {886, 5}

/* Pad: 50*/
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_50 {534, 5}
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_50 {542, 5}

/* Pad: 51*/
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER1 PORT_FUNC5
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_51 {533, 5}
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_51 {541, 5}

/* Pad: 52*/
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_52 {535, 3}
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_52 {543, 3}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_52 {881, 1}

