leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 53*/
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_53 {528, 4}
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_53 {536, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_53 {880, 1}

/* Pad: 54*/
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_54 {514, 6}
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_54 {522, 6}

/* Pad: 55*/
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_55 {886, 6}
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_55 {895, 6}
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_55 {863, 6}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_55 {513, 6}
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_55 {521, 6}
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_55 {883, 6}
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_55 {892, 6}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_55 {924, 5}

/* Pad: 56*/
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_56 {529, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_56 {537, 3}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_56 {656, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_56 {657, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_56 {658, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_56 {659, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_56 {660, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_56 {661, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_56 {662, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_56 {663, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_56 {664, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_56 {665, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_56 {666, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_56 {667, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_56 {668, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_56 {669, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_56 {670, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_56 {671, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_56 {672, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_56 {673, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_56 {674, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_56 {675, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_56 {676, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_56 {677, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_56 {678, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_56 {679, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_56 {680, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_56 {681, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_56 {682, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER30 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER30_PAD_56 {683, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER31 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER31_PAD_56 {684, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER32 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER32_PAD_56 {685, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER33 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER33_PAD_56 {686, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER34 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER34_PAD_56 {687, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER35 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER35_PAD_56 {688, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER36 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER36_PAD_56 {689, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER37 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER37_PAD_56 {690, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER38 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER38_PAD_56 {691, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER39 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER39_PAD_56 {692, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER40 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER40_PAD_56 {693, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER41 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER41_PAD_56 {694, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER42 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER42_PAD_56 {695, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER43 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER43_PAD_56 {696, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER44 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER44_PAD_56 {697, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER45 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER45_PAD_56 {698, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER46 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER46_PAD_56 {699, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER47 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER47_PAD_56 {700, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER48 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER48_PAD_56 {701, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER49 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER49_PAD_56 {702, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER50 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER50_PAD_56 {703, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER51 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER51_PAD_56 {704, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER52 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER52_PAD_56 {705, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER53 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER53_PAD_56 {706, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER54 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER54_PAD_56 {707, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER55 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER55_PAD_56 {708, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER56 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER56_PAD_56 {709, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER57 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER57_PAD_56 {710, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER58 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER58_PAD_56 {711, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER59 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER59_PAD_56 {712, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER60 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER60_PAD_56 {713, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER61 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER61_PAD_56 {714, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER62 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER62_PAD_56 {715, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER63 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER63_PAD_56 {716, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER64 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER64_PAD_56 {717, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER65 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER65_PAD_56 {718, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER66 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER66_PAD_56 {719, 3}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_56 {849, 9}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER67 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER67_PAD_56 {895, 2}

