leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 57*/
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_57 {514, 3}
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_57 {522, 3}
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_57 {576, 2}

/* Pad: 58*/
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_58 {515, 3}
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_58 {523, 3}

/* Pad: 59*/
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 60*/
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER_B PORT_FUNC4
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_60 {533, 1}
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_60 {541, 1}
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_60 {580, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_60 {892, 2}

/* Pad: 61*/
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER_B PORT_FUNC4
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_61 {534, 1}
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_61 {542, 1}
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_61 {585, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_61 {893, 1}

/* Pad: 62*/
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER0 PORT_FUNC5
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_62 {512, 1}
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_62 {520, 1}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_62 {850, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_62 {889, 7}
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_62 {916, 3}

/* Pad: 63*/
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER0 PORT_FUNC5
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER1 PORT_FUNC6
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_63 {513, 1}
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_63 {521, 1}
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_63 {752, 1}
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_63 {772, 1}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_63 {850, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_63 {916, 1}

/* Pad: 64*/
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_64 {530, 1}
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_64 {538, 1}
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_64 {583, 2}
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_64 {760, 1}

