leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 65*/
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_65 {531, 1}
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_65 {539, 1}
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_65 {582, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_65 {894, 1}

/* Pad: 66*/
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_66 {532, 1}
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_66 {540, 1}
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_66 {581, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_66 {892, 1}

/* Pad: 67*/
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER_B PORT_FUNC4
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_67 {535, 1}
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_67 {543, 1}
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_67 {584, 2}

/* Pad: 68*/
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_68 {512, 2}
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_68 {520, 2}
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_68 {579, 1}

/* Pad: 69*/
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_69 {519, 5}
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_69 {527, 5}
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_69 {863, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_69 {882, 3}
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_69 {885, 2}

/* Pad: 70*/
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_70 {533, 3}
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_70 {541, 3}
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_70 {849, 1}

/* Pad: 71*/
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_71 {534, 3}
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_71 {542, 3}

/* Pad: 72*/
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_72 {529, 4}
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_72 {537, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_72 {882, 1}

/* Pad: 73*/
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_73 {530, 3}
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_73 {538, 3}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_73 {880, 2}

/* Pad: 74*/
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER0 PORT_FUNC5
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_74 {518, 6}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_74 {526, 6}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_74 {608, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_74 {609, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_74 {610, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_74 {611, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_74 {612, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_74 {613, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_74 {614, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_74 {615, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_74 {616, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_74 {617, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_74 {618, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_74 {638, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_74 {619, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_74 {620, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_74 {621, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_74 {622, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_74 {623, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_74 {624, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_74 {625, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_74 {626, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_74 {627, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_74 {628, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_74 {629, 11}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_74 {639, 11}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_74 {848, 6}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_74 {850, 2}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_74 {862, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_74 {916, 2}

/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_75 {519, 6}
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_75 {527, 6}

