leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_76 {529, 5}
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_76 {537, 5}

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_80 {513, 3}
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_80 {521, 3}
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_80 {577, 2}

/* Pad: 81*/
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_81 {512, 3}
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_81 {520, 3}
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_81 {578, 2}

/* Pad: 82*/
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_82 {515, 8}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_82 {523, 8}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_82 {608, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_82 {609, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_82 {610, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_82 {611, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_82 {612, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_82 {613, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_82 {614, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_82 {615, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_82 {616, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_82 {617, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_82 {618, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_82 {638, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_82 {619, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_82 {620, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_82 {621, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_82 {622, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_82 {623, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_82 {624, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_82 {625, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_82 {626, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_82 {627, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_82 {628, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_82 {629, 6}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_82 {639, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_82 {889, 3}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_82 {850, 3}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_82 {916, 4}
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_82 {917, 2}

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER1 PORT_FUNC6
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_83 {514, 9}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_83 {522, 9}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_83 {761, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_83 {656, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_83 {657, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_83 {658, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_83 {659, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_83 {660, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_83 {661, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_83 {662, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_83 {663, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_83 {664, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_83 {665, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_83 {666, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_83 {667, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_83 {668, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_83 {669, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_83 {670, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_83 {671, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_83 {672, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_83 {673, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_83 {674, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_83 {675, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_83 {676, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_83 {677, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_83 {678, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_83 {679, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_83 {680, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER30 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER30_PAD_83 {681, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER31 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER31_PAD_83 {682, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER32 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER32_PAD_83 {683, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER33 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER33_PAD_83 {684, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER34 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER34_PAD_83 {685, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER35 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER35_PAD_83 {686, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER36 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER36_PAD_83 {687, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER37 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER37_PAD_83 {688, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER38 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER38_PAD_83 {689, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER39 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER39_PAD_83 {690, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER40 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER40_PAD_83 {691, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER41 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER41_PAD_83 {692, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER42 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER42_PAD_83 {693, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER43 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER43_PAD_83 {694, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER44 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER44_PAD_83 {695, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER45 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER45_PAD_83 {696, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER46 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER46_PAD_83 {697, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER47 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER47_PAD_83 {698, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER48 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER48_PAD_83 {699, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER49 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER49_PAD_83 {700, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER50 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER50_PAD_83 {701, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER51 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER51_PAD_83 {702, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER52 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER52_PAD_83 {703, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER53 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER53_PAD_83 {704, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER54 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER54_PAD_83 {705, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER55 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER55_PAD_83 {706, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER56 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER56_PAD_83 {707, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER57 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER57_PAD_83 {708, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER58 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER58_PAD_83 {709, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER59 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER59_PAD_83 {710, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER60 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER60_PAD_83 {711, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER61 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER61_PAD_83 {712, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER62 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER62_PAD_83 {713, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER63 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER63_PAD_83 {714, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER64 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER64_PAD_83 {715, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER65 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER65_PAD_83 {716, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER66 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER66_PAD_83 {717, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER67 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER67_PAD_83 {718, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER68 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER68_PAD_83 {719, 4}
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER69 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER69_PAD_83 {891, 2}

