leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_84 {513, 9}
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_84 {521, 9}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_84 {883, 3}

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_85 {514, 8}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_85 {522, 8}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_85 {608, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_85 {609, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_85 {610, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_85 {611, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_85 {612, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_85 {613, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_85 {614, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_85 {615, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_85 {616, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_85 {617, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_85 {618, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_85 {638, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_85 {619, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_85 {620, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_85 {621, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_85 {622, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_85 {623, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_85 {624, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_85 {625, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_85 {626, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_85 {627, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_85 {628, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_85 {629, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_85 {639, 3}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_85 {759, 6}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_85 {848, 5}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_85 {862, 3}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_85 {884, 2}
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_85 {894, 9}

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_86 {530, 2}
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_86 {538, 2}

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_87 {531, 2}
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_87 {539, 2}

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_88 {518, 3}
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_88 {526, 3}
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_88 {849, 5}
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_88 {863, 3}

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_89 {513, 5}
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_89 {521, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_89 {895, 3}
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_89 {896, 2}

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_90 {512, 5}
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_90 {520, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_90 {895, 4}

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_91 {515, 5}
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_91 {523, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_91 {895, 5}
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_91 {897, 2}

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_92 {516, 5}
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_92 {524, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_92 {896, 3}

