leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 93*/
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_93 {895, 7}
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_93 {886, 1}
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_93 {863, 7}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_93 {512, 6}
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_93 {520, 6}
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_93 {883, 7}
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_93 {892, 7}

/* Pad: 94*/
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_94 {518, 5}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_94 {526, 5}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_94 {608, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_94 {609, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_94 {610, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_94 {611, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_94 {612, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_94 {613, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_94 {614, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_94 {615, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_94 {616, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_94 {617, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_94 {618, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_94 {638, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_94 {619, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_94 {620, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_94 {621, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_94 {622, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_94 {623, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_94 {624, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_94 {625, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_94 {626, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_94 {627, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_94 {628, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_94 {629, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_94 {639, 10}
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_94 {760, 3}

/* Pad: 95*/
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_95 {532, 3}
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_95 {540, 3}
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_95 {862, 5}
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_95 {863, 25}

/* Pad: 96*/
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_96 {513, 2}
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_96 {521, 2}
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_96 {578, 1}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_96 {892, 3}

