leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 97*/
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 99*/
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 100*/
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 101*/
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 108*/
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 109*/
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_109 {534, 2}
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_109 {542, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_109 {882, 2}
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_109 {888, 2}
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_109 {894, 3}

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_110 {535, 2}
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_110 {543, 2}
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_110 {752, 2}

/* Pad: 111*/
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_111 {528, 5}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_111 {536, 5}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_111 {608, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_111 {609, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_111 {610, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_111 {611, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_111 {612, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_111 {613, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_111 {614, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_111 {615, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_111 {616, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_111 {617, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_111 {618, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_111 {638, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_111 {619, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_111 {620, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_111 {621, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_111 {622, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_111 {623, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_111 {624, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_111 {625, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_111 {626, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_111 {627, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_111 {628, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_111 {629, 12}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_111 {639, 12}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_111 {849, 3}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_111 {886, 3}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_111 {894, 10}

/* Pad: 112*/
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_112 {513, 7}
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_112 {521, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_112 {886, 4}

/* Pad: 113*/
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_113 {514, 7}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_113 {522, 7}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_113 {608, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_113 {609, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_113 {610, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_113 {611, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_113 {612, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_113 {613, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_113 {614, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_113 {615, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_113 {616, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_113 {617, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_113 {618, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_113 {638, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_113 {619, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_113 {620, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_113 {621, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_113 {622, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_113 {623, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_113 {624, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_113 {625, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_113 {626, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_113 {627, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_113 {628, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_113 {629, 2}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_113 {639, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_113 {887, 2}

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER1 PORT_FUNC5
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_114 {517, 6}
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_114 {525, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_114 {917, 3}

