leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 115*/
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER0 PORT_FUNC6
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_115 {512, 7}
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_115 {520, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_115 {886, 11}

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER0 PORT_FUNC6
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_116 {513, 8}
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_116 {521, 8}

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_117 {519, 4}
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_117 {527, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_117 {897, 3}

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_118 {514, 5}
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_118 {522, 5}

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_LIN PORT_FUNC3
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER1 PORT_FUNC6
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER2 PORT_FUNC7
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER3 PORT_FUNC9
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER4 PORT_FUNC10
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER5 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_119 {532, 5}
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_119 {540, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_119 {882, 4}
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_119 {883, 8}
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_119 {886, 9}
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_119 {894, 5}

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_FLEXRAY PORT_FUNC5
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER1 PORT_FUNC6
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER2 PORT_FUNC7
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER3 PORT_FUNC9
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER4 PORT_FUNC10
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER5 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_120 {531, 5}
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_120 {539, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_120 {884, 3}
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_120 {886, 10}

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_121 {530, 4}
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_121 {538, 4}
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_121 {759, 5}
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_121 {772, 3}
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_121 {776, 2}
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_121 {849, 4}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_121 {883, 5}

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_122 {512, 8}
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_122 {520, 8}
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_122 {773, 3}
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_122 {777, 2}

