leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_123 {531, 3}
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_123 {539, 3}

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_124 {890, 2}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_124 {517, 7}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_124 {525, 7}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_124 {761, 2}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_124 {608, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_124 {609, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_124 {610, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_124 {611, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_124 {612, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_124 {613, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_124 {614, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_124 {615, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_124 {616, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_124 {617, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_124 {618, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_124 {638, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_124 {619, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_124 {620, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_124 {621, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_124 {622, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_124 {623, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_124 {624, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_124 {625, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_124 {626, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_124 {627, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_124 {628, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_124 {629, 9}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_124 {639, 9}

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_125 {512, 9}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_125 {520, 9}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_125 {608, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_125 {609, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_125 {610, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_125 {611, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_125 {612, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_125 {613, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_125 {614, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_125 {615, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_125 {616, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_125 {617, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_125 {618, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_125 {638, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_125 {619, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_125 {620, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_125 {621, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_125 {622, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_125 {623, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_125 {624, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_125 {625, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_125 {626, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_125 {627, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_125 {628, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_125 {629, 5}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_125 {639, 5}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_125 {889, 4}

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER2 PORT_FUNC9
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER3 PORT_FUNC10
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER4 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_126 {518, 7}
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_126 {526, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_126 {882, 7}
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_126 {883, 4}
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_126 {885, 3}
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_126 {894, 8}

