leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_143 {533, 2}
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_143 {541, 2}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_143 {924, 2}
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_143 {895, 9}

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_144 {515, 4}
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_144 {523, 4}
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_144 {760, 2}
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_144 {862, 4}
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_144 {863, 26}

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_145 {516, 4}
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_145 {524, 4}

/* Pad: 146*/
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_146 {517, 4}
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_146 {525, 4}

/* Pad: 147*/
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_147 {518, 4}
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_147 {526, 4}
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_147 {863, 4}

/* Pad: 148*/
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_148 {519, 3}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_148 {527, 3}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_148 {656, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_148 {657, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_148 {658, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_148 {659, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_148 {660, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_148 {661, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_148 {662, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_148 {663, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_148 {664, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_148 {665, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_148 {666, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_148 {667, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_148 {668, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_148 {669, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_148 {670, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_148 {671, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_148 {672, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_148 {673, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_148 {674, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_148 {675, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_148 {676, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_148 {677, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_148 {678, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_148 {679, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_148 {680, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_148 {681, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_148 {682, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER30 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER30_PAD_148 {683, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER31 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER31_PAD_148 {684, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER32 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER32_PAD_148 {685, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER33 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER33_PAD_148 {686, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER34 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER34_PAD_148 {687, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER35 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER35_PAD_148 {688, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER36 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER36_PAD_148 {689, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER37 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER37_PAD_148 {690, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER38 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER38_PAD_148 {691, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER39 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER39_PAD_148 {692, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER40 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER40_PAD_148 {693, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER41 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER41_PAD_148 {694, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER42 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER42_PAD_148 {695, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER43 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER43_PAD_148 {696, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER44 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER44_PAD_148 {697, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER45 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER45_PAD_148 {698, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER46 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER46_PAD_148 {699, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER47 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER47_PAD_148 {700, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER48 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER48_PAD_148 {701, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER49 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER49_PAD_148 {702, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER50 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER50_PAD_148 {703, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER51 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER51_PAD_148 {704, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER52 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER52_PAD_148 {705, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER53 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER53_PAD_148 {706, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER54 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER54_PAD_148 {707, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER55 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER55_PAD_148 {708, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER56 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER56_PAD_148 {709, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER57 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER57_PAD_148 {710, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER58 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER58_PAD_148 {711, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER59 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER59_PAD_148 {712, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER60 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER60_PAD_148 {713, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER61 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER61_PAD_148 {714, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER62 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER62_PAD_148 {715, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER63 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER63_PAD_148 {716, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER64 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER64_PAD_148 {717, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER65 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER65_PAD_148 {718, 5}
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER66 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER66_PAD_148 {719, 5}

/* Pad: 149*/
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_149 {543, 8}
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_149 {559, 8}

