leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 150*/
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_SPI PORT_FUNC5
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_150 {541, 8}
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_150 {557, 9}

/* Pad: 151*/
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_151 {542, 8}
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_151 {558, 8}
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_151 {759, 7}
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_151 {850, 4}
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_151 {916, 5}

/* Pad: 152*/
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_152 {523, 9}
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_152 {547, 10}

/* Pad: 153*/
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_153 {522, 10}
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_153 {546, 10}

/* Pad: 154*/
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_154 {536, 8}

/* Pad: 155*/
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_155 {537, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_155 {880, 3}

/* Pad: 156*/
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_156 {539, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_156 {881, 2}

/* Pad: 157*/
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_157 {538, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_157 {880, 4}

/* Pad: 158*/
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_158 {541, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_158 {880, 5}

/* Pad: 159*/
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_159 {540, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_159 {881, 3}

/* Pad: 160*/
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 161*/
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 162*/
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 163*/
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 164*/
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 165*/
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 166*/
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 167*/
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 168*/
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 169*/
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 170*/
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 171*/
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 172*/
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_172 {543, 7}

/* Pad: 173*/
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_GPT PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_173 {542, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_173 {880, 6}

/* Pad: 174*/
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_174 {531, 8}
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_174 {547, 9}
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_174 {923, 2}

