leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 175*/
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_175 {532, 7}
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_175 {548, 8}
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_175 {930, 1}

/* Pad: 176*/
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER0 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_176 {515, 9}
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_176 {547, 8}
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_176 {758, 4}
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_176 {848, 10}
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_176 {850, 5}
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_176 {916, 6}

/* Pad: 177*/
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER1 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_177 {514, 10}
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_177 {546, 8}

/* Pad: 178*/
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER0 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_178 {519, 7}
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_178 {551, 8}

/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER0 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_179 {518, 8}
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_179 {550, 8}
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_179 {758, 3}

/* Pad: 180*/
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER1 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_180 {517, 8}
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_180 {549, 8}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_180 {891, 3}

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER0 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_181 {531, 7}
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_181 {555, 8}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_181 {889, 5}

/* Pad: 182*/
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER0 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_182 {533, 7}
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_182 {557, 8}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_182 {889, 6}

/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_GPT PORT_FUNC9
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER0 PORT_FUNC8
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_183 {535, 7}
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_183 {559, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_183 {890, 3}

/* Pad: 184*/
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_184 {530, 7}
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_184 {554, 8}

/* Pad: 185*/
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_185 {531, 9}
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_185 {555, 9}

/* Pad: 186*/
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_186 {532, 8}
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_186 {556, 8}
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_186 {761, 3}
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_186 {848, 7}

