leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 187*/
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_187 {533, 9}
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_187 {557, 10}

/* Pad: 188*/
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_188 {534, 8}
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_188 {558, 9}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_188 {886, 7}

/* Pad: 189*/
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_189 {535, 9}
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_189 {559, 9}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_189 {886, 8}

/* Pad: 190*/
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_190 {528, 8}
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_190 {552, 9}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_190 {887, 3}

/* Pad: 191*/
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_191 {529, 7}
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_191 {553, 9}

/* Pad: 192*/
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_192 {535, 8}
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_192 {551, 9}
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_192 {925, 2}
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_192 {926, 2}

/* Pad: 193*/
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_193 {533, 8}
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_193 {549, 9}
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_193 {929, 1}

/* Pad: 194*/
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_194 {519, 8}
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_194 {551, 10}
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_194 {931, 1}

/* Pad: 195*/
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_195 {534, 7}
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_195 {550, 9}
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER_A PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_195 {932, 1}

/* Pad: 196*/
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_196 {529, 6}
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_196 {545, 9}

/* Pad: 197*/
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_197 {528, 7}
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_197 {544, 9}

/* Pad: 198*/
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_198 {530, 6}
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_198 {546, 9}
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_198 {922, 3}

/* Pad: 199*/
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_CAN PORT_FUNC3
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_199 {537, 6}
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_199 {545, 10}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_199 {924, 3}

/* Pad: 200*/
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER_A PORT_FUNC1
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_200 {536, 7}
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_200 {544, 10}
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_200 {752, 3}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_A_PAD_200 {922, 2}

/* Pad: 201*/
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_201 {512, 10}
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_201 {520, 10}

