leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 202*/
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_202 {515, 10}
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_202 {523, 10}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_202 {882, 6}
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_202 {883, 9}
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_202 {894, 7}

/* Pad: 203*/
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_203 {513, 10}
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_203 {545, 8}

/* Pad: 204*/
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_204 {514, 11}
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_204 {546, 7}

/* Pad: 205*/
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_205 {519, 9}
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_205 {551, 7}

/* Pad: 206*/
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_206 {515, 11}
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_206 {547, 7}

/* Pad: 207*/
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_207 {516, 9}
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_207 {548, 7}

/* Pad: 208*/
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_208 {517, 9}
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_208 {549, 7}

/* Pad: 209*/
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_209 {544, 1}
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_209 {552, 1}

/* Pad: 210*/
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_210 {546, 1}
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_210 {554, 6}

/* Pad: 211*/
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_211 {547, 1}
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_211 {555, 1}
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_211 {761, 4}

/* Pad: 212*/
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_212 {545, 1}
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_212 {553, 1}

/* Pad: 213*/
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_213 {548, 1}
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_213 {556, 1}
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_213 {760, 4}

/* Pad: 214*/
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_214 {545, 2}
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_214 {553, 2}
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_214 {776, 1}

