leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 215*/
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_215 {549, 1}
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_215 {557, 1}
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_215 {591, 1}

/* Pad: 216*/
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_216 {548, 2}
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_216 {556, 2}
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_216 {761, 5}
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_216 {777, 1}
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_216 {848, 8}

/* Pad: 217*/
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_217 {546, 2}
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_217 {554, 1}

/* Pad: 218*/
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_218 {549, 2}
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_218 {557, 2}

/* Pad: 219*/
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_FLEXRAY PORT_FUNC3
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_219 {551, 1}
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_219 {559, 1}

/* Pad: 220*/
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_220 {544, 2}
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_220 {552, 2}

/* Pad: 221*/
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_LIN PORT_FUNC3
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_221 {547, 2}
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_221 {555, 2}

/* Pad: 222*/
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_FLEXRAY PORT_FUNC6
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_222 {550, 2}
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_222 {558, 2}

/* Pad: 223*/
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_223 {550, 1}
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_223 {558, 1}
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_223 {590, 1}

/* Pad: 224*/
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_FLEXRAY PORT_FUNC3
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER_B PORT_FUNC5
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_224 {551, 2}
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_224 {559, 2}
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_224 {589, 1}

/* Pad: 225*/
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_FLEXRAY PORT_FUNC3
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_225 {544, 3}
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_225 {552, 3}
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_ADC PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ADC_PAD_225 {588, 1}

/* Pad: 226*/
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_FLEXRAY PORT_FUNC3
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_226 {545, 3}
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_226 {553, 3}

