leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 227*/
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_227 {537, 10}
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_227 {553, 8}

/* Pad: 228*/
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_228 {540, 10}
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_228 {556, 7}
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_228 {864, 1}

/* Pad: 229*/
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_229 {539, 10}
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_229 {555, 7}

/* Pad: 230*/
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_230 {538, 9}
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_230 {554, 7}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_230 {900, 1}

/* Pad: 231*/
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_231 {542, 11}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_231 {558, 7}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_231 {720, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_231 {721, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_231 {722, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_231 {723, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_231 {724, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_231 {725, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_231 {726, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_231 {727, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_231 {728, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_231 {729, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_231 {730, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_231 {731, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_231 {732, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_231 {733, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_231 {734, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_231 {735, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_231 {736, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_231 {737, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_231 {738, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_231 {739, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_231 {740, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_231 {741, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_231 {742, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_231 {743, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_231 {744, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_231 {745, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_231 {746, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER30 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER30_PAD_231 {747, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER31 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER31_PAD_231 {748, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER32 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER32_PAD_231 {749, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER33 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER33_PAD_231 {750, 2}
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER34 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER34_PAD_231 {751, 2}

/* Pad: 232*/
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER1 PORT_FUNC9
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER2 PORT_FUNC10
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER3 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_232 {539, 9}
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_232 {555, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_232 {900, 2}

/* Pad: 233*/
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_233 {540, 9}
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_233 {556, 6}

