leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 234*/
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_234 {541, 10}
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_234 {557, 6}

/* Pad: 235*/
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_235 {542, 10}
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_235 {558, 6}

/* Pad: 236*/
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_236 {536, 11}
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_236 {552, 8}

/* Pad: 237*/
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_237 {535, 11}
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_237 {551, 6}

/* Pad: 238*/
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_238 {537, 9}
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_238 {553, 7}

/* Pad: 239*/
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_239 {512, 11}
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_239 {544, 8}
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_239 {760, 5}
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_239 {864, 2}

/* Pad: 241*/
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 242*/
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 243*/
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 244*/
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 245*/
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 246*/
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 247*/
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 248*/
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 249*/
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 250*/
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 251*/
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 252*/
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 253*/
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 254*/
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 255*/
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 256*/
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 257*/
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_257 {528, 9}

