leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 258*/
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_258 {529, 8}

/* Pad: 259*/
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_259 {530, 8}

/* Pad: 260*/
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_260 {531, 10}

/* Pad: 261*/
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_261 {532, 9}

/* Pad: 262*/
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_262 {533, 10}

/* Pad: 263*/
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_263 {534, 9}

/* Pad: 264*/
#define PIN_FUNCTION_REG_264_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_264_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_264_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_264 {535, 10}

/* Pad: 265*/
#define PIN_FUNCTION_REG_265_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_265_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_265_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_265 {552, 4}

/* Pad: 266*/
#define PIN_FUNCTION_REG_266_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_266_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_266_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_266 {553, 4}

/* Pad: 267*/
#define PIN_FUNCTION_REG_267_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_267_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_267_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_267 {554, 2}

/* Pad: 268*/
#define PIN_FUNCTION_REG_268_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_268_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_268_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_268 {555, 3}

/* Pad: 269*/
#define PIN_FUNCTION_REG_269_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_269_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_269_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_269 {556, 3}

/* Pad: 270*/
#define PIN_FUNCTION_REG_270_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_270_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_270_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_270 {557, 3}

/* Pad: 271*/
#define PIN_FUNCTION_REG_271_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_271_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_271_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_271 {558, 3}

/* Pad: 272*/
#define PIN_FUNCTION_REG_272_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_272_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_272_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_272 {559, 3}

/* Pad: 273*/
#define PIN_FUNCTION_REG_273_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_273_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_273_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_273 {544, 4}

/* Pad: 274*/
#define PIN_FUNCTION_REG_274_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_274_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_274_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_274 {545, 4}

/* Pad: 275*/
#define PIN_FUNCTION_REG_275_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_275_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_275_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_275 {546, 3}

/* Pad: 276*/
#define PIN_FUNCTION_REG_276_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_276_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_276_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_276 {547, 3}

/* Pad: 277*/
#define PIN_FUNCTION_REG_277_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_277_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_277_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_277 {548, 3}

/* Pad: 278*/
#define PIN_FUNCTION_REG_278_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_278_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_278_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_278 {549, 3}

/* Pad: 279*/
#define PIN_FUNCTION_REG_279_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_279_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_279_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_279 {550, 3}

/* Pad: 280*/
#define PIN_FUNCTION_REG_280_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_280_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_280_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_280 {551, 3}

/* Pad: 281*/
#define PIN_FUNCTION_REG_281_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_281_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_281_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_281 {552, 5}

/* Pad: 282*/
#define PIN_FUNCTION_REG_282_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_282_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_282_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_282 {553, 5}

