leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 283*/
#define PIN_FUNCTION_REG_283_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_283_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_283_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_283 {554, 3}

/* Pad: 284*/
#define PIN_FUNCTION_REG_284_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_284_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_284_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_284 {555, 4}

/* Pad: 285*/
#define PIN_FUNCTION_REG_285_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_285_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_285_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_285 {556, 4}

/* Pad: 286*/
#define PIN_FUNCTION_REG_286_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_286_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_286_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_286 {557, 4}

/* Pad: 287*/
#define PIN_FUNCTION_REG_287_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_287_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_287_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_287 {558, 4}

/* Pad: 288*/
#define PIN_FUNCTION_REG_288_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_288_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_288_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_288 {559, 4}

/* Pad: 289*/
#define PIN_FUNCTION_REG_289_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_289_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_289_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_289 {536, 9}

/* Pad: 290*/
#define PIN_FUNCTION_REG_290_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_290_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_290_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_290 {537, 8}

/* Pad: 291*/
#define PIN_FUNCTION_REG_291_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_291_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_291_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_291 {538, 7}

/* Pad: 292*/
#define PIN_FUNCTION_REG_292_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_292_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_292_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_292 {539, 8}

/* Pad: 293*/
#define PIN_FUNCTION_REG_293_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_293_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_293_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_293 {540, 8}

/* Pad: 294*/
#define PIN_FUNCTION_REG_294_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_294_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_294_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_294 {541, 9}

/* Pad: 295*/
#define PIN_FUNCTION_REG_295_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_295_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_295_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_295 {542, 9}

/* Pad: 296*/
#define PIN_FUNCTION_REG_296_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_296_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_296_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_296 {543, 9}

/* Pad: 297*/
#define PIN_FUNCTION_REG_297_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_297_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_297_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_297 {544, 5}

/* Pad: 298*/
#define PIN_FUNCTION_REG_298_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_298_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_298_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_298 {545, 5}

/* Pad: 299*/
#define PIN_FUNCTION_REG_299_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_299_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_299_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_299 {546, 4}

/* Pad: 300*/
#define PIN_FUNCTION_REG_300_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_300_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_300_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_300 {547, 4}

/* Pad: 301*/
#define PIN_FUNCTION_REG_301_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_301_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_301_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_301 {548, 4}

/* Pad: 302*/
#define PIN_FUNCTION_REG_302_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_302_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_302_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_302 {549, 4}

/* Pad: 303*/
#define PIN_FUNCTION_REG_303_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_303_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_303_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_303 {550, 4}

/* Pad: 304*/
#define PIN_FUNCTION_REG_304_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_304_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_304_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_304 {551, 4}

/* Pad: 305*/
#define PIN_FUNCTION_REG_305_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_305_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_305_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_305 {544, 6}

/* Pad: 306*/
#define PIN_FUNCTION_REG_306_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_306_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_306_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_306 {545, 6}

/* Pad: 307*/
#define PIN_FUNCTION_REG_307_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_307_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_307_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_307 {546, 5}

/* Pad: 308*/
#define PIN_FUNCTION_REG_308_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_308_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_308_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_308 {547, 5}

/* Pad: 309*/
#define PIN_FUNCTION_REG_309_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_309_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_309_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_309 {548, 5}

/* Pad: 310*/
#define PIN_FUNCTION_REG_310_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_310_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_310_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_310 {549, 5}

