leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 311*/
#define PIN_FUNCTION_REG_311_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_311_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_311_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_311 {550, 5}

/* Pad: 312*/
#define PIN_FUNCTION_REG_312_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_312_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_312_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_312 {551, 5}

/* Pad: 313*/
#define PIN_FUNCTION_REG_313_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_313_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_313_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_313 {552, 6}

/* Pad: 314*/
#define PIN_FUNCTION_REG_314_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_314_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_314_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_314 {553, 6}

/* Pad: 315*/
#define PIN_FUNCTION_REG_315_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_315_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_315_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_315 {554, 4}

/* Pad: 316*/
#define PIN_FUNCTION_REG_316_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_316_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_316_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_316 {555, 5}

/* Pad: 317*/
#define PIN_FUNCTION_REG_317_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_317_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_317_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_317 {556, 5}

/* Pad: 318*/
#define PIN_FUNCTION_REG_318_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_318_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_318_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_318 {557, 5}

/* Pad: 319*/
#define PIN_FUNCTION_REG_319_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_319_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_319_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_319 {558, 5}

/* Pad: 320*/
#define PIN_FUNCTION_REG_320_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_320_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_320_PORT_PIN_MODE_OTHER0 PORT_FUNC10
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_320 {559, 5}

/* Pad: 321*/
#define PIN_FUNCTION_REG_321_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_321_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_321_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_321_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_321_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_321 {518, 9}
#define PIN_FUNCTION_REG_321_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_321 {550, 7}

/* Pad: 322*/
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_322 {536, 10}
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_322 {552, 7}
#define PIN_FUNCTION_REG_322_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_322 {848, 9}

/* Pad: 240*/
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_240 {538, 8}
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_240 {554, 5}

/* Pad: 323*/
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_323 {541, 11}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_323 {557, 7}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_323 {720, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER4 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_323 {721, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER5 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_323 {722, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER6 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER6_PAD_323 {723, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER7 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER7_PAD_323 {724, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER8 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER8_PAD_323 {725, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER9 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER9_PAD_323 {726, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER10 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER10_PAD_323 {727, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER11 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER11_PAD_323 {728, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER12 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER12_PAD_323 {729, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER13 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER13_PAD_323 {730, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER14 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER14_PAD_323 {731, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER15 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER15_PAD_323 {732, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER16 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER16_PAD_323 {733, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER17 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER17_PAD_323 {734, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER18 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER18_PAD_323 {735, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER19 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER19_PAD_323 {736, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER20 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER20_PAD_323 {737, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER21 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER21_PAD_323 {738, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER22 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER22_PAD_323 {739, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER23 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER23_PAD_323 {740, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER24 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER24_PAD_323 {741, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER25 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER25_PAD_323 {742, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER26 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER26_PAD_323 {743, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER27 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER27_PAD_323 {744, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER28 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER28_PAD_323 {745, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER29 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER29_PAD_323 {746, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER30 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER30_PAD_323 {747, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER31 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER31_PAD_323 {748, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER32 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER32_PAD_323 {749, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER33 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER33_PAD_323 {750, 3}
#define PIN_FUNCTION_REG_323_PORT_PIN_MODE_OTHER34 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER34_PAD_323 {751, 3}

/* Pad: 324*/
#define PIN_FUNCTION_REG_324_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_324_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_324_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_324_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_324_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_324 {543, 10}
#define PIN_FUNCTION_REG_324_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_324 {559, 6}

/* Pad: 325*/
#define PIN_FUNCTION_REG_325_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_325_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_325_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_325_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_325_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_325 {528, 10}
#define PIN_FUNCTION_REG_325_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_325 {544, 7}

/* Pad: 326*/
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_326 {529, 9}
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_326 {545, 7}
#define PIN_FUNCTION_REG_326_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_326 {898, 1}

