leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5777m_portdefs.h
/* Pad: 327*/
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_327 {530, 9}
#define PIN_FUNCTION_REG_327_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_327 {546, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_327 {900, 3}

/* Pad: 328*/
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_328 {531, 11}
#define PIN_FUNCTION_REG_328_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_328 {547, 6}

/* Pad: 329*/
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_329 {532, 10}
#define PIN_FUNCTION_REG_329_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_329 {548, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_329 {900, 4}

/* Pad: 330*/
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_330 {533, 11}
#define PIN_FUNCTION_REG_330_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_330 {549, 6}

/* Pad: 331*/
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_GPT PORT_FUNC8
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_OTHER0 PORT_FUNC9
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_OTHER1 PORT_FUNC10
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_OTHER2 PORT_FUNC11
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_331 {534, 10}
#define PIN_FUNCTION_REG_331_PORT_PIN_MODE_OTHER3 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_331 {550, 6}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_331 {899, 1}

/* Pad: 332*/
#define PIN_FUNCTION_REG_332_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_332_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 333*/
#define PIN_FUNCTION_REG_333_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_333_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 334*/
#define PIN_FUNCTION_REG_334_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_334_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 335*/
#define PIN_FUNCTION_REG_335_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_335_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 336*/
#define PIN_FUNCTION_REG_336_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_336_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 337*/
#define PIN_FUNCTION_REG_337_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_337_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 338*/
#define PIN_FUNCTION_REG_338_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_338_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 339*/
#define PIN_FUNCTION_REG_339_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_339_PORT_PIN_MODE_ADC PORT_FUNCADC

#endif  /* _MPC5777M_PORTDEFS_H*/
